Revit 2026 API

# CriticalPathCollectorGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<MEPNetworkSegmentId> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of MEPNetworkSegmentId)
```
```cpp
public:
virtual IEnumerator<MEPNetworkSegmentId^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<MEPNetworkSegmentId>
override GetEnumerator : unit -> IEnumerator<MEPNetworkSegmentId>
```

#### Return Value

IEnumeratorMEPNetworkSegmentIdAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

CriticalPathCollector Class

Autodesk.Revit.DB.Analysis Namespace